const fs = require('fs');
const fetch = require('node-fetch');


const names = ["滨之澜苑","水韵金沙公寓","大诸桥新村","大诸桥村","定北家园","方家畈村","方家苑小区","横桥村","横桥沈合苑","江口村","金都艺墅","朗郡庭园","沈家弄新村","沈家弄村","午山村","阳明谷","云栖玫瑰园","之江路","转塘家园","转塘新村","转塘村","转塘直街","转塘里街","冠苑","圣苑小区","耀江文鼎苑","崇文公寓","马塍路","求智巷","求智弄","日晖新村5、6、32、37","文二新村","文二路19-57号（单号）","文锦苑","西溪河东","下宁巷","慧仁家园博慧苑","慧仁家园恒慧苑","慧仁家园文慧苑","慧仁家园明慧苑","慧仁家园聚慧苑","同仁家园怡心苑","同仁家园景新苑","同仁家园逸林苑","同仁家园金河湾","同仁家园金涛港","同仁家园馨香苑","中海紫藤苑","紫郡东苑","紫郡西苑","白沙泉","北山路","孤山路","金沙曲苑","里东山弄","栖霞岭","仁寿山","曙光公寓","外东山弄（61幢和62幢除外）","杨公堤","恒升花苑","上宁新村","沈塘新村","世贸丽晶城","文三新村","文三路","武林巷","武林门新村","邮电新村","和家园","栖岚院","西木坞","御溪花苑","九树公寓","澜玉水晶熙园","珊瑚沙家园","珊瑚沙村","盛世诚品公寓","五云东路２０号","五云中路２号","云庄","云溪新语公寓","云荷廷公寓云轩","云荷廷公寓溪轩","云荷廷公寓竺轩","之江九里","之江悦公寓","之江路１３８号","沐桥公寓","港湾家园","紫金西苑","青石桥","青芝坞","青芝坞新村","求是村","石虎山","曙光新村","外东山弄61幢和62幢","西溪路","玉古路","浙大新村","宝石一路","宝石二路","宝石山下二弄","宝石山下五弄","宝石山下四弄","宝石新村","丁香公寓","杭大新村","黄龙雅苑","混堂巷","金祝新村","金祝花园","锦绣文苑","绿园","罗马公寓","跑马场","启真名苑","胜利新村","松木场河东","松木场河西","松木场铁路新村","松溪公寓","桃园新村","桃花弄","王家弄","文天公寓","武林花园","沿山河村","窑背巷","友谊新村","昭庆寺里街２２号","采荷玉荷新村","采荷青莼新村","茶厂宿舍","荷花新村","金牛坊","凯旋新村1-15幢","凯旋苑","青荷苑","清泰小区","商教新村","商教苑","铁路花圃新村","夕照新村","昌化新村","和乐苑","湖滨阁","环西新村","混堂桥","戒坛寺巷","景湖苑","劳工弄","狮虎桥河下","桃花河新村","万寿亭公寓","万寿亭街","武林桥河下","西子铭苑","延龄苑","直戒坛寺巷","长生路","承德里二弄","崔家巷","大庆里一弄","大庆里二弄","鸿源坊","宏农里","里仁坊巷","龙翔里一弄","平海公寓","菩提寺路","齐心里","劝业里","仁和路","仁和里","思鑫坊","思鑫坊直弄","宋浇造巷","未央村","五福里一弄","五福里三弄","五福里二弄","向阳新村","孝女路","星远里三弄","学士路","延定巷","延庆里","邮电路","岳王新村","岳王路","枝头巷","萱寿里","萱寿里二弄","蕙宜村","蕲王路","好学府","钱江候潮府","钱江御府","仁滨公寓","上品华庭","望江府","闻潮一品公寓","闻潮尚庭","紫轩","富星苑","恒丰坊","华龙坊","南光坊","鸥江公寓","钱塘人家","钱塘名都","钱江苑","文华苑","新城坊","耀江福村"];

!(async () => {

  const CACHE = {};
  for (let i = 0; i < names.length; i++) {
    console.log(`${i}/${names.length}`)
    const res = await fetch(`https://hangzhou.anjuke.com/esf-ajax/community/pc/autocomplete/?city_id=18&kw=${encodeURIComponent(names[i])}`, {
      "headers": {
        "accept": "application/json, text/plain, */*",
      },
      "referrer": "https://hangzhou.anjuke.com/sale/rd1/?q=%E7%8E%8B%E5%AE%B6%E5%BC%84",
    }).then(d => d.json())

    console.log(res)
    const price = Math.max(res.data.map(d => Number(d.price)));

    CACHE[names[i]] = price;
    console.log(CACHE);
  }
  console.log(CACHE);
})();